<a href="https://colab.research.google.com/github/suarezthura1/Githubtesting/blob/main/Cole.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [16]:

import fbprophet
from fbprophet import Prophet
import pandas as pd
import matplotlib.pyplot as plt

In [17]:
df=pd.read_csv('/content/Coffee_Dataset.csv')
df.head()

   Index       Month Grade   Price
0      1  01/01/2013    AA  236.98
1      2  01/01/2013    AB  211.06
2      3  01/01/2013     C  168.10
3      4  01/02/2013    AA  267.01
4      5  01/02/2013    AB  231.54

In [18]:
df.tail()

     Index       Month Grade  Price
298    299  01/07/2021    AB  259.1
299    300  01/07/2021     C  224.7
300    301  01/08/2021    AA  314.4
301    302  01/08/2021    AB  249.9
302    303  01/08/2021     C  217.6

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Index   303 non-null    int64
 1   Month   303 non-null    object
 2   Grade   303 non-null    object
 3   Price   303 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 9.6+ KB

In [20]:
model = Prophet()

In [21]:
df.drop('Index',axis=1,inplace=True)

In [22]:
df.head()

        Month Grade   Price
0  01/01/2013    AA  236.98
1  01/01/2013    AB  211.06
2  01/01/2013     C  168.10
3  01/02/2013    AA  267.01
4  01/02/2013    AB  231.54

In [23]:
df.drop('Grade',axis=1,inplace=True)

In [24]:
df.head()

        Month   Price
0  01/01/2013  236.98
1  01/01/2013  211.06
2  01/01/2013  168.10
3  01/02/2013  267.01
4  01/02/2013  231.54

In [25]:
df['Month'] = pd.to_datetime(df['Month'])
df.head()

       Month   Price
0 2013-01-01  236.98
1 2013-01-01  211.06
2 2013-01-01  168.10
3 2013-01-02  267.01
4 2013-01-02  231.54

In [26]:
df.columns = ['ds','y']
df.head()

          ds       y
0 2013-01-01  236.98
1 2013-01-01  211.06
2 2013-01-01  168.10
3 2013-01-02  267.01
4 2013-01-02  231.54

In [27]:
df.tail()

            ds      y
298 2021-01-07  259.1
299 2021-01-07  224.7
300 2021-01-08  314.4
301 2021-01-08  249.9
302 2021-01-08  217.6

In [28]:
model.fit(df)

INFO:numexpr.utils:NumExpr defaulting to 2 threads.
INFO:fbprophet:Disabling daily seasonality. Run prophet with daily_seasonality=True to override this.